Укажите, пожалуйста, как выглядит связь многие ко многим при проектировании в MySQL Workbench?

 Создается промежуточная таблица с составным первичным ключом, связанным с внешними ключями связываемых отношений. 
 При этом связи с промежуточной таблицей становятся один ко многим.
 
 Связь с "вороньими лапками" на обоих концах, что соответствует нотации ER-диаграммы
 
 Создается промежуточная таблица с составным первичным ключом и внешними ключами, связанными 
 с первичными ключами связываемых отношений. При этом связи с промежуточной таблицей становятся один ко многим.  +
 
 Создается промежуточная таблица с внешними ключами, связанными с первичными ключами связываемых отношений. 
 При этом связи с промежуточной таблицей становятся один к одному.
 
 Ни один вариант не корректен.
