Спроектируйте структуру SQL-таблицы для хранения дерева папок.

Таблица для хранения дерева папок.
------------------------------------------------------------------
-- Справочник папок 
------------------------------------------------------------------
Create table test.folders 
( id int,
  title varchar(64),
  content varchar(256)
-- // остановимся на таких полях, но их может быть намного больше 
);

select * from test.folders; 

------------------------------------------------------------------
--Таблица для хранения иерархии страниц
------------------------------------------------------------------
Create table test.folder_tree 
( id int,
  child int,
  parent int 
);

select * from test.folder_tree; 
